{"config": {"name": "model_1", "output_layers": [["merge_1", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, 60]}, "inbound_nodes": []}, {"name": "dense_1", "class_name": "Dense", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "units": 100, "activation": "relu"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "dense_2", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "units": 50, "activation": "relu"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "dense_3", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "units": 50, "activation": "relu"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "dense_4", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "units": 1, "activation": "softmax"}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "dense_5", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "units": 2, "activation": "linear"}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "dense_6", "class_name": "Dense", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "dense_6", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "units": 2, "activation": "abs"}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "merge_1", "class_name": "Merge", "config": {"name": "merge_1", "output_mask": null, "concat_axis": -1, "output_mask_type": "raw", "output_shape": null, "mode": "concat", "mode_type": "raw", "dot_axes": -1, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["dense_4", 0, 0, {}], ["dense_5", 0, 0, {}], ["dense_6", 0, 0, {}]]]}]}, "keras_version": "2.0.4", "class_name": "Model", "backend": "theano"}