{"config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 60]}, "inbound_nodes": []}, {"name": "dense_1", "class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "units": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "trainable": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "units": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "units": 50, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "trainable": true}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "softmax", "bias_constraint": null, "trainable": true}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_5", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "trainable": true}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "dense_6", "class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_6", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "abs", "bias_constraint": null, "trainable": true}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "dense_7", "class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_7", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "softmax", "bias_constraint": null, "trainable": true}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "dense_8", "class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_8", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "trainable": true}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "dense_9", "class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_9", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "abs", "bias_constraint": null, "trainable": true}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "dense_10", "class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_10", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "softmax", "bias_constraint": null, "trainable": true}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "dense_11", "class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_11", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "trainable": true}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "dense_12", "class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_12", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "abs", "bias_constraint": null, "trainable": true}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "merge_1", "class_name": "Merge", "config": {"mode_type": "raw", "concat_axis": -1, "output_mask": null, "output_shape_type": "raw", "dot_axes": -1, "name": "merge_1", "output_mask_type": "raw", "mode": "concat", "arguments": {}, "output_shape": null}, "inbound_nodes": [[["dense_4", 0, 0, {}], ["dense_5", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "merge_2", "class_name": "Merge", "config": {"mode_type": "raw", "concat_axis": -1, "output_mask": null, "output_shape_type": "raw", "dot_axes": -1, "name": "merge_2", "output_mask_type": "raw", "mode": "concat", "arguments": {}, "output_shape": null}, "inbound_nodes": [[["dense_7", 0, 0, {}], ["dense_8", 0, 0, {}], ["dense_9", 0, 0, {}]]]}, {"name": "merge_3", "class_name": "Merge", "config": {"mode_type": "raw", "concat_axis": -1, "output_mask": null, "output_shape_type": "raw", "dot_axes": -1, "name": "merge_3", "output_mask_type": "raw", "mode": "concat", "arguments": {}, "output_shape": null}, "inbound_nodes": [[["dense_10", 0, 0, {}], ["dense_11", 0, 0, {}], ["dense_12", 0, 0, {}]]]}], "output_layers": [["merge_1", 0, 0], ["merge_2", 0, 0], ["merge_3", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.0.4", "class_name": "Model", "backend": "theano"}