{"config": {"name": "model_1", "output_layers": [["merge_1", 0, 0], ["merge_2", 0, 0]], "layers": [{"name": "input_1", "config": {"name": "input_1", "batch_input_shape": [null, 60], "dtype": "float32", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "dense_1", "config": {"units": 100, "activity_regularizer": null, "name": "dense_1", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}}, "class_name": "Dense", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "dense_2", "config": {"units": 80, "activity_regularizer": null, "name": "dense_2", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}}, "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_3", "config": {"units": 50, "activity_regularizer": null, "name": "dense_3", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}}, "class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "dense_4", "config": {"units": 1, "activity_regularizer": null, "name": "dense_4", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "dense_5", "config": {"units": 2, "activity_regularizer": null, "name": "dense_5", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "dense_6", "config": {"units": 2, "activity_regularizer": null, "name": "dense_6", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "abs", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "dense_7", "config": {"units": 1, "activity_regularizer": null, "name": "dense_7", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "dense_8", "config": {"units": 2, "activity_regularizer": null, "name": "dense_8", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "dense_9", "config": {"units": 2, "activity_regularizer": null, "name": "dense_9", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "abs", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "merge_1", "config": {"dot_axes": -1, "mode_type": "raw", "output_shape": null, "output_shape_type": "raw", "mode": "concat", "name": "merge_1", "output_mask_type": "raw", "concat_axis": -1, "arguments": {}, "output_mask": null}, "class_name": "Merge", "inbound_nodes": [[["dense_4", 0, 0, {}], ["dense_5", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "merge_2", "config": {"dot_axes": -1, "mode_type": "raw", "output_shape": null, "output_shape_type": "raw", "mode": "concat", "name": "merge_2", "output_mask_type": "raw", "concat_axis": -1, "arguments": {}, "output_mask": null}, "class_name": "Merge", "inbound_nodes": [[["dense_7", 0, 0, {}], ["dense_8", 0, 0, {}], ["dense_9", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]]}, "backend": "theano", "class_name": "Model", "keras_version": "2.0.4"}